In [1]:
import numpy as np
import pandas as pd

#### MISSING DATA

In [2]:
d = {"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [7]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.dropna(thresh = 2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [9]:
df.dropna(thresh = 3)

     A    B  C
0  1.0  5.0  1

In [10]:
df.dropna(thresh = 3,axis=1)

   C
0  1
1  2
2  3

In [11]:
df.fillna(value = df[["A","B","C"]].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [12]:
d1 = {"X":[1,2,np.nan],"Y":[5,np.nan,6],"Z":[1,2,3]}

In [13]:
df1 = pd.DataFrame(d1)

In [14]:
df1

     X    Y  Z
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  6.0  3

In [15]:
df1.fillna(value = df1[["X","Y","Z"]].mean())

     X    Y  Z
0  1.0  5.0  1
1  2.0  5.5  2
2  1.5  6.0  3

In [16]:
df1.fillna(value = df1[["X","Y","Z"]].mean(),inplace = True)

In [17]:
df1

     X    Y  Z
0  1.0  5.0  1
1  2.0  5.5  2
2  1.5  6.0  3

#### GROUP BY

In [18]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [19]:
dataf = pd.DataFrame(data)

In [20]:
dataf

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [21]:
bycomp = dataf.groupby("Company")

In [22]:
bycomp.mean(numeric_only = True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [23]:
bycomp.sum(numeric_only = True)

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [24]:
bycomp.std(numeric_only = True)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [25]:
bycomp.sum(numeric_only = True).loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [26]:
dataf.groupby("Company").sum(numeric_only = True).loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [27]:
dataf.groupby("Company").sum(numeric_only = True)

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [28]:
dataf.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [29]:
dataf.groupby("Company").max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [30]:
dataf.groupby("Company").min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [31]:
dataf.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [32]:
dataf.groupby("Company").describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [33]:
dataf.groupby("Company").describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [34]:
dataf.groupby("Company").describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [35]:
dataf.groupby("Company").describe().transpose()['MSFT']

Sales  count      2.000000
       mean     232.000000
       std      152.735065
       min      124.000000
       25%      178.000000
       50%      232.000000
       75%      286.000000
       max      340.000000
Name: MSFT, dtype: float64